balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF707.PIC
<?xml version="1.0" ?><edc:PIC edc:arch="16xxxx" edc:desc="" edc:dosid="01347" edc:dsid="41418" edc:informedby="DOS PS DS" edc:isextended="false" edc:masksetid="LEBF" edc:name="PIC16LF707" edc:procid="0xd707" edc:psid="41405" xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Import>
    <edc:Module_import edc:modsrc="16xxxx-NMMR.Module"/>
  </edc:Import>
  <edc:Power>
    <edc:VPP edc:defaultvoltage="9.000" edc:maxvoltage="9.000" edc:minvoltage="8.000"/>
    <edc:VDD edc:maxdefaultvoltage="3.600" edc:maxvoltage="3.600" edc:mindefaultvoltage="1.800" edc:minvoltage="1.800" edc:nominalvoltage="3.300"/>
  </edc:Power>
  <edc:Programming edc:boundary="8" edc:erasealgo="1" edc:hasrowerasecmd="true" edc:hasvppfirst="true" edc:lvpthresh="2.700" edc:memtech="ee" edc:tries="1">
    <edc:Wait edc:cfg="5000" edc:eedata="8000" edc:erase="6000" edc:lverase="6000" edc:lvpgm="2500" edc:pgm="2500" edc:userid="2500"/>
    <edc:Latches edc:cfg="1" edc:eedata="1" edc:pgm="8" edc:rowerase="32" edc:userid="1"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="16xxxx" edc:name="16xxxx">
    <edc:MemTraits edc:hwstackdepth="8">
      <edc:CodeMemTraits edc:locsize="0x1" edc:wordimpl="0x3fff" edc:wordinit="0x3fff" edc:wordsafe="0x3fff" edc:wordsize="0x2"/>
      <edc:CalDataMemTraits edc:locsize="0x1" edc:wordimpl="0x3fff" edc:wordinit="0x3fff" edc:wordsafe="0x3fff" edc:wordsize="0x2"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x1" edc:wordimpl="0x3fff" edc:wordinit="0x3fff" edc:wordsafe="0x3fff" edc:wordsize="0x2"/>
      <edc:TestMemTraits edc:locsize="0x1" edc:wordimpl="0x3fff" edc:wordinit="0x3fff" edc:wordsafe="0x3fff" edc:wordsize="0x2"/>
      <edc:UserIDMemTraits edc:locsize="0x1" edc:wordimpl="0x7f" edc:wordinit="0x3fff" edc:wordsafe="0x7f" edc:wordsize="0x2"/>
      <edc:ConfigFuseMemTraits edc:locsize="0x2" edc:wordimpl="0x3fff" edc:wordinit="0x3fff" edc:wordsafe="0x3fff" edc:wordsize="0x2"/>
      <edc:DeviceIDMemTraits edc:locsize="0x1" edc:wordimpl="0x3fff" edc:wordinit="0x3fff" edc:wordsafe="0x3fff" edc:wordsize="0x2"/>
      <edc:EEDataMemTraits edc:magicoffset="0x2100"/>
      <edc:DataMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0x0" edc:wordsafe="0xff" edc:wordsize="0x1"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:Breakpoints edc:hasdatacapture="false" edc:hwbpcount="1" edc:idbyte="x"/>
  <edc:ProgramSpace>
    <edc:CodeSector edc:beginaddr="0x0" edc:endaddr="0x800" edc:issection="true" edc:regionid="page0" edc:sectiondesc="ROM code space - page0" edc:sectionname="PROG0"/>
    <edc:CodeSector edc:beginaddr="0x800" edc:endaddr="0x1000" edc:issection="true" edc:regionid="page1" edc:sectiondesc="ROM code space - page1" edc:sectionname="PROG1"/>
    <edc:CodeSector edc:beginaddr="0x1000" edc:endaddr="0x1800" edc:issection="true" edc:regionid="page2" edc:sectiondesc="ROM code space - page2" edc:sectionname="PROG2"/>
    <edc:CodeSector edc:beginaddr="0x1800" edc:endaddr="0x2000" edc:issection="true" edc:regionid="page3" edc:sectiondesc="ROM code space - page3" edc:sectionname="PROG3"/>
    <edc:TestZone edc:beginaddr="0x2000" edc:endaddr="0x2100" edc:regionid="testmem"/>
    <edc:UserIDSector edc:beginaddr="0x2000" edc:endaddr="0x2004" edc:issection="true" edc:regionid=".idlocs" edc:sectiondesc="ID locations" edc:sectionname="IDLOCS"/>
    <edc:DeviceIDSector edc:beginaddr="0x2006" edc:endaddr="0x2007" edc:mask="0x3fe0" edc:regionid="devid" edc:value="0x1AE0">
      <edc:DEVIDToRev edc:revlist="a0" edc:value="0x1AE0"/>
    </edc:DeviceIDSector>
    <edc:ConfigFuseSector edc:beginaddr="0x2007" edc:endaddr="0x2009" edc:regionid=".config">
      <edc:DCRDef edc:access="--nn-nnn-nnnnnnn" edc:cname="CONFIG" edc:default="0xffff" edc:desc="" edc:impl="0x377f" edc:name="CONFIG" edc:nzwidth="0x10" edc:unimplval="1" edc:unused="0x3000" edc:useinchecksum="0x377f">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FOSC" edc:desc="Oscillator Selection bits" edc:mask="0x7" edc:name="FOSC" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="EXTRC" edc:desc="RC oscillator: CLKOUT function on RA6/OSC2/CLKOUT pin, RC on RA7/OSC1/CLKIN" edc:when="(field &amp; 0x7) == 0x7">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_EXTRC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="EXTRCIO" edc:desc="RCIO oscillator: I/O function on RA6/OSC2/CLKOUT pin, RC on RA7/OSC1/CLKIN" edc:when="(field &amp; 0x7) == 0x6">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_EXTRCIO"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="INTOSC" edc:desc="INTOSC oscillator: CLKOUT function on RA6/OSC2/CLKOUT pin, I/O function  on RA7/OSC1/CLKIN" edc:when="(field &amp; 0x7) == 0x5">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_INTOSC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="INTOSCIO" edc:desc="INTOSCIO oscillator: I/O function on RA6/OSC2/CLKOUT and RA7/OSC1/CLKIN pins" edc:when="(field &amp; 0x7) == 0x4">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_INTOSCIO"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="EC_OSC" edc:desc="EC oscillator: I/O function on RA6/OSC2/CLKOUT pin, CLKIN on RA7/OSC1/CLKIN" edc:when="(field &amp; 0x7) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_EC_OSC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HS_OSC" edc:desc="HS oscillator: High Speed crystal/resonator on RA6/OSC2/CLKOUT and RA7/OSC1/CLKIN" edc:when="(field &amp; 0x7) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_HS_OSC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="XT_OSC" edc:desc="XT oscillator: Crystal/resonator on RA6/OSC2/CLKIN and RA7/OSC1/CLKIN" edc:when="(field &amp; 0x7) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_XT_OSC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="LP_OSC" edc:desc="LP oscillator: Low-power crystal on RA6/OSC2/CLKOUT and RA7/OSC1/CLKIN" edc:when="(field &amp; 0x7) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_LP_OSC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTE" edc:desc="Watchdog Timer Enable bit" edc:mask="0x1" edc:name="WDTE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="WDT enabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_WDT_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="WDT disabled and can be enabled by SWDTEN bit of the WDTCON register" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_WDT_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PWRTE" edc:desc="Power-up Timer Enable bit" edc:mask="0x1" edc:name="PWRTE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PWRT disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PWRT enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="MCLRE" edc:desc="RE3/MCLR Pin Function Select bit" edc:mask="0x1" edc:name="MCLRE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="RE3/MCLR pin function is MCLR" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="RE3/MCLR pin function is digital input, MCLR internally tied to VDD" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CP" edc:desc="Code Protection bit" edc:mask="0x1" edc:name="CP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Program memory code protection is disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Program memory code protection is enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x20" edc:endaddr="0x2000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="BOREN" edc:desc="Brown-out Reset Selection bits" edc:mask="0x3" edc:name="BOREN" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="BOR enabled" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="NSLEEP" edc:desc="BOR enabled during operation and disabled in Sleep" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="BOR disabled (Preconditioned State)" edc:islanghidden="true" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="BOR disabled (Preconditioned State)" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BORV" edc:desc="Brown-out Reset Voltage Selection bit" edc:mask="0x1" edc:name="BORV" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="19" edc:desc="Brown-out Reset Voltage (VBOR) set to 1.9 V nominal" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="25" edc:desc="Brown-out Reset Voltage (VBOR) set to 2.5 V nominal" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="PLLEN" edc:desc="INTOSC PLLEN Enable Bit" edc:mask="0x1" edc:name="PLLEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="INTOSC Frequency is 16 MHz (32x)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="INTOSC Frequency is 500 kHz" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DEBUG" edc:desc="In-Circuit Debugger Mode bit" edc:ishidden="true" edc:mask="0x1" edc:name="DEBUG" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="In-Circuit Debugger disabled, RB6/ICSPCLK and RB7/ICSPDAT are general purpose I/O pins" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="In-Circuit Debugger enabled, RB6/ICSPCLK and RB7/ICSPDAT are dedicated to the debugger" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------" edc:cname="CONFIG2" edc:default="0xffff" edc:desc="" edc:impl="0x0" edc:name="CONFIG2" edc:nzwidth="0x8" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x0">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:BACKBUGVectorSector edc:beginaddr="0x2004" edc:endaddr="0x2005" edc:regionid="debug"/>
  </edc:ProgramSpace>
  <edc:DataSpace edc:endaddr="0x200">
    <edc:RegardlessOfMode>
      <edc:NMMRPlace edc:regionid="corenmmrs">
        <edc:Module_ref edc:modsrc="16xxxx-NMMR.Module"/>
      </edc:NMMRPlace>
      <edc:SFRDataSector edc:bank="0" edc:beginaddr="0x0" edc:endaddr="0x20" edc:regionid="sfr0">
        <edc:SFRDef edc:access="--------" edc:cname="INDF" edc:desc="" edc:impl="0x0" edc:isindirect="true" edc:isvolatile="false" edc:mclr="--------" edc:name="INDF" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INDF" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="INDF" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TMR0" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR0" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TMR0" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
