balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF707.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PORTB" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB2" edc:desc="" edc:mask="0x1" edc:name="RB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB3" edc:desc="" edc:mask="0x1" edc:name="RB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB4" edc:desc="" edc:mask="0x1" edc:name="RB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5" edc:desc="" edc:mask="0x1" edc:name="RB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6" edc:desc="" edc:mask="0x1" edc:name="RB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7" edc:desc="" edc:mask="0x1" edc:name="RB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RB" edc:desc="" edc:mask="0xff" edc:name="RB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AN12" edc:desc="" edc:mask="0x1" edc:name="AN12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AN10" edc:desc="" edc:mask="0x1" edc:name="AN10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AN8" edc:desc="" edc:mask="0x1" edc:name="AN8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AN9" edc:desc="" edc:mask="0x1" edc:name="AN9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AN11" edc:desc="" edc:mask="0x1" edc:name="AN11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AN13" edc:desc="" edc:mask="0x1" edc:name="AN13" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CPSB8" edc:desc="" edc:mask="0x1" edc:name="CPSB8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSB9" edc:desc="" edc:mask="0x1" edc:name="CPSB9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSB10" edc:desc="" edc:mask="0x1" edc:name="CPSB10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSB11" edc:desc="" edc:mask="0x1" edc:name="CPSB11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSB12" edc:desc="" edc:mask="0x1" edc:name="CPSB12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSB13" edc:desc="" edc:mask="0x1" edc:name="CPSB13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSB14" edc:desc="" edc:mask="0x1" edc:name="CPSB14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSB15" edc:desc="" edc:mask="0x1" edc:name="CPSB15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="CCP2" edc:desc="" edc:mask="0x1" edc:name="CCP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T1G" edc:desc="" edc:mask="0x1" edc:name="T1G" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="T3CKI" edc:desc="" edc:mask="0x1" edc:name="T3CKI" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PORTC" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC0" edc:desc="" edc:mask="0x1" edc:name="RC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1" edc:desc="" edc:mask="0x1" edc:name="RC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2" edc:desc="" edc:mask="0x1" edc:name="RC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3" edc:desc="" edc:mask="0x1" edc:name="RC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4" edc:desc="" edc:mask="0x1" edc:name="RC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5" edc:desc="" edc:mask="0x1" edc:name="RC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC6" edc:desc="" edc:mask="0x1" edc:name="RC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC7" edc:desc="" edc:mask="0x1" edc:name="RC7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RC" edc:desc="" edc:mask="0xff" edc:name="RC" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CPSB2" edc:desc="" edc:mask="0x1" edc:name="CPSB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSB3" edc:desc="" edc:mask="0x1" edc:name="CPSB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSB4" edc:desc="" edc:mask="0x1" edc:name="CPSB4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CPSA9" edc:desc="" edc:mask="0x1" edc:name="CPSA9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSA10" edc:desc="" edc:mask="0x1" edc:name="CPSA10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSA11" edc:desc="" edc:mask="0x1" edc:name="CPSA11" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T1OSO" edc:desc="" edc:mask="0x1" edc:name="T1OSO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1OSI" edc:desc="" edc:mask="0x1" edc:name="T1OSI" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TBCKI" edc:desc="" edc:mask="0x1" edc:name="TBCKI" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK" edc:desc="" edc:mask="0x1" edc:name="SCK" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI" edc:desc="" edc:mask="0x1" edc:name="SDI" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDO" edc:desc="" edc:mask="0x1" edc:name="SDO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX" edc:desc="" edc:mask="0x1" edc:name="TX" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RX" edc:desc="" edc:mask="0x1" edc:name="RX" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T1CKI" edc:desc="" edc:mask="0x1" edc:name="T1CKI" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2" edc:desc="" edc:mask="0x1" edc:name="CCP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1" edc:desc="" edc:mask="0x1" edc:name="CCP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCL" edc:desc="" edc:mask="0x1" edc:name="SCL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDA" edc:desc="" edc:mask="0x1" edc:name="SDA" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CK" edc:desc="" edc:mask="0x1" edc:name="CK" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DT" edc:desc="" edc:mask="0x1" edc:name="DT" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PORTD" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD0" edc:desc="" edc:mask="0x1" edc:name="RD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD1" edc:desc="" edc:mask="0x1" edc:name="RD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD2" edc:desc="" edc:mask="0x1" edc:name="RD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD3" edc:desc="" edc:mask="0x1" edc:name="RD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD4" edc:desc="" edc:mask="0x1" edc:name="RD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD5" edc:desc="" edc:mask="0x1" edc:name="RD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD6" edc:desc="" edc:mask="0x1" edc:name="RD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD7" edc:desc="" edc:mask="0x1" edc:name="RD7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RD" edc:desc="" edc:mask="0xff" edc:name="RD" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CPSB5" edc:desc="" edc:mask="0x1" edc:name="CPSB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSB6" edc:desc="" edc:mask="0x1" edc:name="CPSB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSB7" edc:desc="" edc:mask="0x1" edc:name="CPSB7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSA8" edc:desc="" edc:mask="0x1" edc:name="CPSA8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSA12" edc:desc="" edc:mask="0x1" edc:name="CPSA12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSA13" edc:desc="" edc:mask="0x1" edc:name="CPSA13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSA14" edc:desc="" edc:mask="0x1" edc:name="CPSA14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSA15" edc:desc="" edc:mask="0x1" edc:name="CPSA15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T3G" edc:desc="" edc:mask="0x1" edc:name="T3G" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----rnnn" edc:cname="PORTE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="PORTE" edc:nzwidth="0x8" edc:por="----xxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RE0" edc:desc="" edc:mask="0x1" edc:name="RE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1" edc:desc="" edc:mask="0x1" edc:name="RE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2" edc:desc="" edc:mask="0x1" edc:name="RE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE3" edc:desc="" edc:mask="0x1" edc:name="RE3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RE" edc:desc="" edc:mask="0xff" edc:name="RE" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AN5" edc:desc="" edc:mask="0x1" edc:name="AN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AN6" edc:desc="" edc:mask="0x1" edc:name="AN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AN7" edc:desc="" edc:mask="0x1" edc:name="AN7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="nMCLR" edc:desc="" edc:mask="0x1" edc:name="nMCLR" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CPSA5" edc:desc="" edc:mask="0x1" edc:name="CPSA5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSA6" edc:desc="" edc:mask="0x1" edc:name="CPSA6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSA7" edc:desc="" edc:mask="0x1" edc:name="CPSA7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PCLATH" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="PCLATH" edc:nzwidth="0x8" edc:por="---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCLATH" edc:desc="" edc:mask="0x1f" edc:name="PCLATH" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
