balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF707.PIC
        <edc:SFRDef edc:access="nn--nnrn" edc:cname="CPSBCON0" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000" edc:name="CPSBCON0" edc:nzwidth="8" edc:por="00--0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TBXCS" edc:desc="" edc:mask="0x1" edc:name="TBXCS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSBOUT" edc:desc="" edc:mask="0x1" edc:name="CPSBOUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSBRNG" edc:desc="" edc:mask="0x3" edc:name="CPSBRNG" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CPSBRM" edc:desc="" edc:mask="0x1" edc:name="CPSBRM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSBON" edc:desc="" edc:mask="0x1" edc:name="CPSBON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CPSBRNG0" edc:desc="" edc:mask="0x1" edc:name="CPSBRNG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSBRNG1" edc:desc="" edc:mask="0x1" edc:name="CPSBRNG1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CPSBCON1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CPSBCON1" edc:nzwidth="8" edc:por="----0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CPSBCH" edc:desc="" edc:mask="0xf" edc:name="CPSBCH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CPSBCH0" edc:desc="" edc:mask="0x1" edc:name="CPSBCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSBCH1" edc:desc="" edc:mask="0x1" edc:name="CPSBCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSBCH2" edc:desc="" edc:mask="0x1" edc:name="CPSBCH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSBCH3" edc:desc="" edc:mask="0x1" edc:name="CPSBCH3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn--nnrn" edc:cname="CPSACON0" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000" edc:name="CPSACON0" edc:nzwidth="8" edc:por="00--0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TAXCS" edc:desc="" edc:mask="0x1" edc:name="TAXCS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSAOUT" edc:desc="" edc:mask="0x1" edc:name="CPSAOUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSARNG" edc:desc="" edc:mask="0x3" edc:name="CPSARNG" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CPSARM" edc:desc="" edc:mask="0x1" edc:name="CPSARM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSAON" edc:desc="" edc:mask="0x1" edc:name="CPSAON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CPSARNG0" edc:desc="" edc:mask="0x1" edc:name="CPSARNG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSARNG1" edc:desc="" edc:mask="0x1" edc:name="CPSARNG1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CPSACON1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CPSACON1" edc:nzwidth="8" edc:por="----0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CPSACH" edc:desc="" edc:mask="0xf" edc:name="CPSACH" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CPSACH0" edc:desc="" edc:mask="0x1" edc:name="CPSACH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSACH1" edc:desc="" edc:mask="0x1" edc:name="CPSACH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSACH2" edc:desc="" edc:mask="0x1" edc:name="CPSACH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPSACH3" edc:desc="" edc:mask="0x1" edc:name="CPSACH3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:Mirror edc:nzsize="0x2" edc:regionidref="sfr0"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMDATL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PMDATL" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMDATL" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="PMDATL" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMADRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PMADRL" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMADRL" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="PMADRL" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
